/*__________________________________________________________________________________
|      	Chave Digital Tecnologia Eletronica Ltda. 
|       
|       Blumenau - SC
|       www.chavedigital.com.br
| __________________________________________________________________________________
|
|       This source code was developed by Chave Digital and cannot be copied, in part 
|       or in whole, or used, except when legally licensed by Chave Digital
|       or its distributors.
|
|       Este código é propriedade da Chave Digital e não pode ser copiado, em parte 
|       ou em todo, ou utilizado, exceto quando for legalmente licenciado pela 
|       Chave Digital ou por um de seus distribuidores.
| __________________________________________________________________________________
|
|       Arquivo            :  Poolingdecoder.c
|       Descrição          :  Monitoração dos endereços de dispositivos em alarme
| 
|       Autor              :  Marcos Aquino
|       Data criação       :  14/04/2011
|
|       Revisões           :  1.0
|
|
| __________________________________________________________________________________
*/
/***********************************************************************************
*		Includes
***********************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <mc9s08ac128.h>
#include "PoolingDecoder.h"
#include "eventosSistema.h"
#include "devicesDecoder.h"
#include "lacos.h"
#include "filaDevices.h"
#include "parametros.h"
/***********************************************************************************
*		Definições com constantes utilizadas no programa
***********************************************************************************/ 



/***********************************************************************************
*		Enumerações
***********************************************************************************/


/***********************************************************************************
*		Estruturas
***********************************************************************************/


/***********************************************************************************
*		Uniões
***********************************************************************************/


/***********************************************************************************
*		Constantes
***********************************************************************************/


/***********************************************************************************
*		Variaveis locais
***********************************************************************************/


/***********************************************************************************
*		Funções locais
***********************************************************************************/
 
/***********************************************************************************
*		Implementação
***********************************************************************************/

/***********************************************************************************
*   Descrição     :   Faz o pooling dos decodificadores de endereço em
*                     busca de novos eventos de alarme endeçados
*   Parametros    :   nenhum
*   Retorno       :   nenhum
***********************************************************************************/
void POOLINGDECODER_entry(void){
  unsigned char i,device;
  
  for(i=0;i<3;i++)
    if(!PARAMETROS_leBloqueio(i) && PARAMETROS_carregaConfigLaco(i) && FILADEVICES_get(i,&device)){
      (void)EVSY_insereAlarme(i,device);    
      LACOS_setAlarme(i);
    }   
}
/***********************************************************************************
*   Descrição     :  
*   Parametros    : 
*   Retorno       : 
***********************************************************************************/
void POOLINGDECODER_reset(void){
  
  
  
}
/***********************************************************************************
*		Fim do arquivo
***********************************************************************************/